#include<iostream>
using namespace std;
void menu()
{
	printf_s("                                                 双链表功能菜单 \n");
	printf_s("                                ---------------------- ---------------------- \n");
	printf_s("                                                   0.退出链表\n");
	printf_s("                                ********************************************* \n");
	printf_s("                                    * 1.创建初始链表 * * 2.销毁该次链表 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 3.返回首元引用 * * 4.返回尾元引用 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 5.插入首位元素 * * 6.删除首位元素 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 7.插入末尾元素 * * 8.删除末尾元素 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 9.插入任位元素 * * 10.删除任位元素 *\n");
	printf_s("                                ********************** **********************\n");
	printf_s("                                    * 11.清空该次链表 * * 12.查找元素存在 *\n");
	printf_s("                                ********************** **********************\n");
	printf_s("                                    * 13.统计元素数量 * * 14.打印链表元素 *\n");
	printf_s("                                ********************** **********************\n");
	printf_s("                                ---------------------- ---------------------- \n");
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
}
